#include "UI.h"
#include <iostream>


void UI::printGameOver()
{
	std::cout <<
		"  _______      ___      .___  ___.  _______    " << std::endl <<
		"/  _____|     /   \\     |   \\/   | |   ____| " << std::endl <<
		"|  |  __     /  ^  \\    |  \\  /  | |  |__    " << std::endl <<
		"|  | |_ |   /  /_\\  \\   |  |\\/|  | |   __|  " << std::endl <<
		"|  |__| |  /  _____  \\  |  |  |  | |  |____   " << std::endl <<
		" \\______| /__/     \\__\\ |__|  |__| |_______|" << std::endl;
	std::cout << std::endl <<
		"        ####      ####   " << std::endl <<
		"      ########  ######## " << std::endl <<
		"     ##########  ########" << std::endl <<
		"     #########  #########" << std::endl <<
		"      #######*  ######## " << std::endl <<
		"        ####  ########   " << std::endl <<
		"          ###  *####     " << std::endl <<
		"            *#  #*  " << std::endl;
	std::cout <<
		"  ______   ____    ____  _______ .______          " << std::endl <<
		" /  __  \\  \\   \\  /   / |   ____||   _  \\     " << std::endl <<
		"|  |  |  |  \\   \\/   /  |  |__   |  |_)  |      " << std::endl <<
		"|  |  |  |   \\      /   |   __|  |      /        " << std::endl <<
		"|  `--'  |    \\    /    |  |____ |  |\\  \\--.   " << std::endl <<
		" \\______/      \\__/     |_______|| _| `.___|    " << std::endl;

}
void UI::printGameClear()
{
	std::cout <<
		"                               **                                " << std::endl <<
		"                              *****                              " << std::endl <<
		"                             *******                             " << std::endl <<
		"                            *********                            " << std::endl <<
		"                    *************************                    " << std::endl <<
		"                  *****************************                  " << std::endl <<
		"         **         *************************         **         " << std::endl <<
		"        ****           *******************           ****        " << std::endl <<
		"       ******           *****************           ******       " << std::endl <<
		" ******************     *****************     ****************** " << std::endl <<
		"   **************       *****************       **************   " << std::endl <<
		"     **********        ********   ********        **********     " << std::endl <<
		"    ***********        ****           ****        ***********    " << std::endl <<
		"    ***** ******                                 ****** *****    " << std::endl <<
		"    **        **                                 **        **" << std::endl;
}

void UI::printCharacter()
{
	std::cout <<
		"       ¡á¡á¡á¡á         " << std::endl <<
		"       ¡á¡á¡á¡á         " << std::endl <<
		"  ¢Æ  ¡á¡á¡á¡á¡á¡á¡á¡á      " << std::endl <<
		" ¢Æ¢Æ¢Æ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á    " << std::endl <<
		"¢Æ¢Æ¢Æ¢Æ¢Æ¡á  ¡á¡á  ¡á¡á    " << std::endl <<
		" ¢Æ¢Æ¢Æ¡á¡á ¡Ü  ¡Ü ¡á¡á     " << std::endl <<
		" ¡á¢Æ¡á¡á¡á¡á    ¡á¡á¡á¢Æ¢Æ¢Æ  " << std::endl <<
		" ¡á¢Æ   ¡Ø¡Ø¡Ø¡Ø¡Ø¡Ø ¢Æ¢Æ¢Æ¢Æ¢Æ" << std::endl <<
		" ¡á¢Æ¡á¡á        ¢Æ¢Æ¢Æ¢Æ¢Æ" << std::endl <<
		"  ¢Æ¡á¡á¡á¡Ø¡Ø¡Ø¡Ø¡Ø¡Ø¡Ø¢Æ¢Æ¢Æ¢Æ¢Æ " << std::endl <<
		"  ¢Æ¡á¡á¡á¡Ø¡Ø¡Ø¡Ø¡Ø¡Ø¡Ø¡á¢Æ¢Æ¢Æ  " << std::endl <<
		"  ¢Æ¡á¡á    ¡á    ¡á¡á   " << std::endl <<
		"  ¢Æ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á" << std::endl;
}

void UI::printSlime()
{
	std::cout <<
		"       #######         " << std::endl <<
		"    ###       ####     " << std::endl <<
		"  ##             ###   " << std::endl <<
		" ##                ### " << std::endl <<
		"##   (¡Ú¨¬)  (¡Ú¨¬)     ###" << std::endl <<
		"##       ¡ü          ##" << std::endl <<
		" ##                ##" << std::endl <<
		"   ################  " << std::endl;
}
void UI::printGoblin()
{
	std::cout <<
		"         ######         " << std::endl <<
		" ###/###////////###/### " << std::endl <<
		"  ####///////////#####  " << std::endl <<
		"   ###/#  #//#  #####   " << std::endl <<
		"      ##////////##      " << std::endl <<
		"       #////////#       " << std::endl <<
		"      #/########/#    " << std::endl <<
		"     #/#/#/##/#/#/\\     " << std::endl <<
		"    /###////////###/#   " << std::endl <<
		"   \\##  ########  ##/   " << std::endl <<
		"        ###  ###        " << std::endl <<
		"       #//#  ///# " << std::endl;
}
void UI::printOrk()
{
	std::cout <<
		"                .      .                " << std::endl <<
		"                ./....//                " << std::endl <<
		"              . /.....///.              " << std::endl <<
		"              .//./....//               " << std::endl <<
		"            ..///.///./////.            " << std::endl <<
		"          /./..././//./...../..         " << std::endl <<
		"       ./....././..//...//......./      " << std::endl <<
		"     ....//.................//..../     " << std::endl <<
		"    .....#/........//......///...../    " << std::endl <<
		"   ..../## //....//##//..///. //..//.   " << std::endl <<
		"   ../##    /###/.///.//##/.   .///##   " << std::endl <<
		"   ...//       ////////##       /../#   " << std::endl <<
		"  . ///      ////##########.    /#//#   " << std::endl <<
		"   ../      ##/#########//###    #/#/   " << std::endl <<
		"   .../   .../##///####/###/..   /##.   " << std::endl <<
		" ///.    .....//###//####//....    ./// " << std::endl <<
		"         ....//#/       /#//...         " << std::endl <<
		"         /.///#          ////...        " << std::endl <<
		"        ...//#/           ##//..        " << std::endl <<
		"         //////           //////        " << std::endl <<
		"         ...///           //....        " << std::endl <<
		"          ...//           #/...         " << std::endl <<
		"           ..//           //..          " << std::endl <<
		"           /..#           /..           " << std::endl <<
		"        ...////           #//....       " << std::endl <<
		"       ///////            .//////       " << std::endl;
}

void UI::printAttack()
{
	std::cout <<
		"                 ¡Ø¡¡¡¡¡¡¡¡" << std::endl <<
		"    88            ¡Ø¡Ø¡¡¡¡" << std::endl <<
		"    88             ¡Ø¡Ø¡¡" << std::endl <<
		"888888¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á ¡Ø¡Ø¡Ø" << std::endl <<
		"888888¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á ¡Ø¡Ø¡Ø" << std::endl <<
		"    88             ¡Ø¡Ø¡¡" << std::endl <<
		"    88            ¡Ø¡Ø¡¡¡¡" << std::endl <<
		"                 ¡Ø¡¡¡¡¡¡¡¡" << std::endl;
}
